#+TITLE: Day 7
#+PROPERTY: header-args:python :session day7
#+PROPERTY: header-args:python+ :tangle main.py
#+PROPERTY: header-args:python+ :results value
#+PROPERTY: header-args:python+ :shebang "#!/usr/bin/env python"

In our previous project, we explored running DeepSeek to classify financial news
articles. Now we are going to be building an AI assistant that can answer
questions based on documents that we provide.

#+BEGIN_SRC elisp :exports none :results none
  (setq org-babel-python-command (concat
                                  (file-name-directory (or load-file-name (buffer-file-name)))
                                  ".venv/bin/python"))
#+END_SRC

#+begin_src python :exports none :results none
  # This file was generated from the README.org found in this directory
#+end_src

In this section we are going to learn a really powerful technique called RAG, or
Retrieval augmented generation. We are also going to leverage a super powerful
tool called LangChain.

In this project we'll build an AI assistant that can answer questions about a
specific topic (the Eleven Madison Park restaurant) based on provided documents
in a database. This technique is called Retrieval-Augmented Generation (RAG).

*Workflow*:
1. *Input Text*: "What kind of food does Eleven Madison Park Restaurant serve?"
2. *Database Search*: The assistant will search the database to find relevant
   information.
3. *Fetch Information*: The assistant will Fetch any context it found relevant.
4. *Output Text*: "Eleven Madison Park serves a fully plant-based menu, using no
   animal products."

** Setup
   Now let's setup our initial libraries for our program:
   #+name: setup
   #+begin_src python :results none :exports both
     # Let's install and import OpenAI Package
     from openai import OpenAI  

     # Let's import os, which stands for "Operating System"
     import os

     # This will be used to load the API key from the .env file
     from dotenv import load_dotenv
     load_dotenv()

     # Get the OpenAI API keys from environment variables
     openai_api_key = os.getenv("OPENAI_API_KEY")

     # Let's configure the OpenAI Client using our key
     openai_client = OpenAI(api_key=openai_api_key)
   #+end_src

   To debug we can even print our API key:
   #+name: debugsetup
   #+begin_src python :results output :exports both :tangle no
     print("OpenAI client successfully configured.")

     # Let's view the first few characters in the key
     print(openai_api_key[:15])
   #+end_src

   #+RESULTS: debugsetup
   : OpenAI client successfully configured.
   : sk-WOOzJ30J0lBF

   We should also import the LangChain libraries we need:
   #+name: langchainimport
   #+begin_src python :results none :exports both
     from langchain_openai import OpenAIEmbeddings, OpenAI
     from langchain_chroma import Chroma
     from langchain_text_splitters import RecursiveCharacterTextSplitter
     from langchain_community.document_loaders import TextLoader
     from langchain_classic.chains import RetrievalQAWithSourcesChain
   #+end_src

   Then we can set our datafile:
   #+name: datafile
   #+begin_src python :results output :exports both
     # Define the path to your data file
     # Ensure 'eleven_madison_park_data.txt' is in the same folder as this notebook
     DATA_FILE_PATH = "eleven_madison_park_data.txt"
     print(f"Data file path set to: {DATA_FILE_PATH}")
   #+end_src

   #+RESULTS: datafile
   : Data file path set to: eleven_madison_park_data.txt

   Let's load our datafile:
   #+name: loaddatafile
   #+begin_src python :results output :exports both
     # Let's load Eleven Madison Park Restaurant data, which has been scraped from their website
     # The data is saved in "eleven_madison_park_data.txt", Langchain's TextLoader makes this easy to read
     print(f"Attempting to load data from: {DATA_FILE_PATH}")

     # Initialize the TextLoader with the file path and specify UTF-8 encoding
     # Encoding helps handle various characters correctly
     loader = TextLoader(DATA_FILE_PATH, encoding = "utf-8")

     # Load the document(s) using TextLoader from LangChain, which loads the entire file as one Document object
     raw_documents = loader.load()
     print(f"Successfully loaded {len(raw_documents)} document(s).")
   #+end_src

   #+RESULTS: loaddatafile
   : Attempting to load data from: eleven_madison_park_data.txt
   : Successfully loaded 1 document(s).

   To confirm we loaded everything properly let's print a few characters from
   our datafile:
   #+name: debugdatafile
   #+begin_src python :results output :exports both :tangle no
     # Let's display a few characters of the loaded content to perform a sanity check!
     print(raw_documents[0].page_content[:500] + "...")
   #+end_src

   #+RESULTS: debugdatafile
   #+begin_example
   Source: https://www.elevenmadisonpark.com/
   Title: Eleven Madison Park
   Content:
   Book on Resy
   ---END OF SOURCE---

   Source: https://www.elevenmadisonpark.com/careers
   Title: Careers — Eleven Madison Park
   Content:
   Join Our Team Eleven Madison Park ▾ All Businesses Eleven Madison Park Clemente Bar Daniel Humm Hospitality Filter Categories Culinary Pastry Wine & Beverage Dining Room Office & Admin Other Job Types Full Time Part Time Compensation Salary Hourly Apply filters OPEN OPPORTUNITIES Staff Acco...
   #+end_example

** Embeddings in a 3d space!
   Let's now look at the words "king", "queen", "prince", and "princess". While
   these words share similar gender and age attributes with "man", "woman",
   "boy", and "girl", they have different meanings. To distinguish "man" from
   "king", "woman" from "queen", we need to introduce a new semantic feature
   that sets them apart. We'll call this feature "Royalty".

   With a third dimension we might end up with something like this:
   | Word        | Gender | Age | Royalty |
   |-------------+--------+-----+---------|
   | man         |      1 |   7 |       1 |
   | woman       |      9 |   7 |       1 |
   | boy         |      1 |   2 |       1 |
   | girl        |      9 |   2 |       1 |
   | grandfather |      1 |   9 |       1 |
   | grandmother |      9 |   9 |       1 |
   | child       |      5 |   2 |       5 |
   | king        |      1 |   8 |       8 |
   | queen       |      9 |   7 |       8 |
   | prince      |      1 |   2 |       8 |
   | princess    |      9 |   2 |       8 |

   Now, we convert our text chunks into *embeddings* (numerical vectors) using
   OpenAI. Similar text chunks will have similar vectors. We then store these
   vectors in a *vector store* (ChromaDB) for fast searching.
   - *Embeddings*: Text -> Numbers (Vectors) representing meaning.
   - *Vector Store*: Database optimized for searching these vectors.

   Also check out the [[https://projector.tensorflow.org/][Tensorflow Ebeddings projector (it's fun!)]].

   Let's initialize our embeddings:
   #+name: initembeddings
   #+begin_src python :results output :exports both
     # Let's initialize our embeddings model. Note that we will use OpenAI's embedding model 
     print("Initializing OpenAI Embeddings model...")

     # Create an instance of the OpenAI Embeddings model
     # Langchain handles using the API key we loaded earlier
     embeddings = OpenAIEmbeddings(openai_api_key = openai_api_key)

     print("OpenAI Embeddings model initialized.")

     # Let's Create ChromaDB Vector Store
     print("\nCreating ChromaDB vector store and embedding documents...")

     # Now the chunks from 'documents' are being converted to a vector using the 'embeddings' model
     # The vectors are then stored as a vector in ChromaDB
     # You could add `persist_directory="./my_chroma_db"` to save it to disk
     # You will need to specify: (1) The list of chunked Document objects and (2) The embedding model to use
     vector_store = Chroma.from_documents(documents = documents, embedding = embeddings)  

     # Verify the number of items in the store
     vector_count = vector_store._collection.count()
     print(f"ChromaDB vector store created with {vector_count} items.")

     if vector_count == 0:
         raise ValueError("Vector store creation resulted in 0 items. Check previous steps.")
   #+end_src

   #+RESULTS: initembeddings
   : Initializing OpenAI Embeddings model...
   : OpenAI Embeddings model initialized.
   : 
   : Creating ChromaDB vector store and embedding documents...
   : ChromaDB vector store created with 38 items.

   To debug and make sure we got everything right we can print a chunk of our
   stored data:
   #+name: debugvectorestore
   #+begin_src python :results output :exports both :tangle no
     # Let's retrieve the first chunk of stored data from the vector store
     stored_data = vector_store._collection.get(include=["embeddings", "documents"], limit = 1)

     # Display the results
     print("First chunk text:\n", stored_data['documents'][0])
     print("\nEmbedding vector:\n", stored_data['embeddings'][0])
     print(f"\nFull embedding has {len(stored_data['embeddings'][0])} dimensions.")
   #+end_src

   We get:
   #+RESULTS: debugvectorestore
   #+begin_example
   First chunk text:
    Source: https://www.elevenmadisonpark.com/
   Title: Eleven Madison Park
   Content:
   Book on Resy
   ---END OF SOURCE---

   Embedding vector:
    [ 0.02318246 -0.01573779 -0.00694174 ... -0.02468781 -0.01027062
    -0.06141846]

   Full embedding has 1536 dimensions.
   #+end_example

   We can see in this output that the first chunk is the human readable text
   that we understand. The second block of output is the embedding vector that
   the AI model sees and works with.

* Building & testing the RAG chain using LangChain
  Now we assemble the core RAG logic using Langchain's
  ~RetrievalQAWithSourcesChain~. This chain combines:
    1. A *Retriever*: Fetches relevant documents from our ~vector_store~.
    2. An *LLM*: Generates the answer based on the question and retrieved
       documents (we'll use OpenAI).

  This specific chain type automatically handles retrieving documents,
  formatting them with the question for the LLM, and tracking the sources.

  So let's implement the retriever:
  #+name: retreiver
  #+begin_src python :results output :exports both
    # --- 1. Define the Retriever ---
    # The retriever uses the vector store to fetch documents
    # We configure it to retrieve the top 'k' documents
    retriever = vector_store.as_retriever(search_kwargs={"k": 3})
    print("Retriever configured successfully from vector store.")

    # --- 2. Define the Language Model (LLM) from OpenAI---
    # Temperature controls the model's creativity; 'temperature=0' aims for more factual, less creative answers
    # You might need to specify a more powerful model, such as "gpt-3.5-turbo-instruct"
    llm = OpenAI(temperature = 1.3, openai_api_key = openai_api_key)
    print("OpenAI LLM successfully initialized.")

    # --- 3. Create the RetrievalQAWithSourcesChain ---
    # This chain type is designed specifically for Q&A with source tracking.
    # chain_type="stuff": Puts all retrieved text directly into the prompt context.
    #                      Suitable if the total text fits within the LLM's context limit.
    #                      Other types like "map_reduce" handle larger amounts of text.
    qa_chain = RetrievalQAWithSourcesChain.from_chain_type(llm = llm,
                                                           chain_type = "stuff",
                                                           retriever = retriever,
                                                           return_source_documents = True,  # Request the actual Document objects used
                                                           verbose = True)  # Set to True to see Langchain's internal steps (can be noisy)

    print("RetrievalQAWithSourcesChain created")
  #+end_src

  #+RESULTS: retreiver
  : Retriever configured successfully from vector store.
  : OpenAI LLM successfully initialized.
  : RetrievalQAWithSourcesChain created

  Like usual we should debug our retreiver:
  #+name: debugretreiver
  #+begin_src python :results output :exports both :tangle no
    # --- Test the Full Chain ---
    print("\n--- Testing the Full RAG Chain ---")
    chain_test_query = "What kind of food does Eleven Madison Park serve?"
    print(f"Query: {chain_test_query}")

    # Run the query through the chain. Use invoke() for Langchain >= 0.1.0
    # The input must be a dictionary, often with the key 'question'.
    try:
        result = qa_chain.invoke({"question": chain_test_query})

        # Print the answer and sources from the result dictionary
        print("\n--- Answer ---")
        print(result.get("answer", "No answer generated."))

        print("\n--- Sources ---")
        print(result.get("sources", "No sources identified."))

        # Optionally print snippets from the source documents returned
        if "source_documents" in result:
            print("\n--- Source Document Snippets ---")
            for i, doc in enumerate(result["source_documents"]):
                content_snippet = doc.page_content[:250].strip()
                print(f"Doc {i+1}: {content_snippet}")

    except Exception as e:
        print(f"\nAn error occurred while running the chain: {e}")
        # Consider adding more specific error handling if needed
  #+end_src

  #+RESULTS: debugretreiver
  #+begin_example

  --- Testing the Full RAG Chain ---
  Query: What kind of food does Eleven Madison Park serve?


  [1m> Entering new RetrievalQAWithSourcesChain chain...[0m

  [1m> Finished chain.[0m

  --- Answer ---
   Eleven Madison Park serves a fully plant-based menu.


  --- Sources ---
  eleven_madison_park_data.txt

  --- Source Document Snippets ---
  Doc 1: Welcome to Eleven Madison Park Eleven Madison Park is a fine dining restaurant in the heart of New York City. Overlooking Madison Square Park–one of Manhattan’s most beautiful green spaces–we sit at the base of a historic Art Deco building on the cor
  Doc 2: Source: https://www.elevenmadisonpark.com/ourrestaurant
  Title: About — Eleven Madison Park
  Content:
  Doc 3: Source: https://www.elevenmadisonpark.com/faq
  Title: FAQs — Eleven Madison Park
  Content:
  #+end_example

